
## Plan Result (generate_ansible_inventory)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * github_repository_file.frr_config


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_repository_file.frr_config will be created
  + resource "github_repository_file" "frr_config" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "main"
      + commit_message               = "feat: update BGP frr.conf"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            router bgp 64600
             bgp router-id 10.151.10.1
             bgp ebgp-requires-policy
             maximum-paths 4
             redistribute connected
             redistribute static
            
             neighbor cilium-tiny_k3s_cluster peer-group
             neighbor cilium-tiny_k3s_cluster remote-as 64602
             neighbor cilium-tiny_k3s_cluster activate
             neighbor cilium-tiny_k3s_cluster soft-reconfiguration inbound
             neighbor cilium-tiny_k3s_cluster timers 15 45
             neighbor cilium-tiny_k3s_cluster timers connect 15
             neighbor 10.151.15.8 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.15.16 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.15.17 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.15.18 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.15.19 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.16.8 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.16.9 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.16.10 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.16.16 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.16.17 peer-group cilium-tiny_k3s_cluster
             neighbor 10.151.16.18 peer-group cilium-tiny_k3s_cluster
             neighbor cilium-wanda_k3s_cluster peer-group
             neighbor cilium-wanda_k3s_cluster remote-as 64601
             neighbor cilium-wanda_k3s_cluster activate
             neighbor cilium-wanda_k3s_cluster soft-reconfiguration inbound
             neighbor cilium-wanda_k3s_cluster timers 15 45
             neighbor cilium-wanda_k3s_cluster timers connect 15
             neighbor 10.151.15.8 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.16 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.17 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.18 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.19 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.8 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.16 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.17 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.18 peer-group cilium-wanda_k3s_cluster
             neighbor 10.151.15.19 peer-group cilium-wanda_k3s_cluster
            
             address-family ipv4
              neighbor cilium-tiny_k3s_cluster activate
              neighbor cilium-tiny_k3s_cluster send-community all
              neighbor cilium-tiny_k3s_cluster route-map ALLOW-ALL in
              neighbor cilium-tiny_k3s_cluster route-map ALLOW-ALL out
              neighbor cilium-wanda_k3s_cluster activate
              neighbor cilium-wanda_k3s_cluster send-community all
              neighbor cilium-wanda_k3s_cluster route-map ALLOW-ALL in
              neighbor cilium-wanda_k3s_cluster route-map ALLOW-ALL out
             exit-address-family
            
            route-map ALLOW-ALL permit 10
        EOT
      + file                         = "ansible/frr.conf"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "lab-ops"
      + sha                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":568,"Program":"tfcmt","SHA1":"","Target":"generate_ansible_inventory","Vars":{}} -->